insert into type values(null,'IT'),
						(null,'문학'),
						(null,'인문'),
						(null,'여행');

select * from type;


select * from product join type using (t_no);		

update product set p_detail = '‘생각을 통제할 것인가, 통제당할 것인가?’
당신은 무엇을 선택할 것인가
매사추세츠대 심리학과 교수가 최신 연구 사례로 밝혀낸 직관의 힘

프린스턴대학교에 재학 중이던 BJ 밀러는 술을 마시고 전기셔틀 기차에 올랐다가 큰 사고를 당한다. 이 사고로 그는 두 다리와 한 팔을 절단하는 수술을 했고, 큰 후유증까지 얻었다. 한순간에 혼자서는 일어설 수도, 걸을 수도 없게 된 밀러는 자신에게 찾아온 불행에 절망하는 대신, 지금 자신이 할 수 있는 일을 찾아 그것을 삶의 목표로 삼기로 결심한다. 치료를 마친 그는 이듬해 패럴림픽에 배구팀 국가대표로 출전했고, 이후 자신과 같은 사고를 당한 사람들을 위한 완화치료전문가가 되었으며, TED와 같은 수많은 강연장에 서며 자신의 감동적인 스토리를 전하고 있다.

절망적인 순간, 밀러를 일으켜 세운 원동력은 무엇이었을까? 오랫동안 긍정 심리에 대해 연구해온 캐서린 샌더슨 교수는 그 비밀이 직관에 있다고 말한다. 불편함, 곤란한 상황, 인생의 일부인 이러한 크고 작은 사건 사고들은 예기치 못하게 찾아오지만, 그런 통제 불가능한 상황에 대비하기 위해 우리의 뇌가 직관적으로 판단을 내리고 행동을 하게끔 한 것이다. 바로 사건이나 문제를 바라보는 우리의 사고방식을 통제할 수 있다면, 우리의 삶을 자기 자신이 생각하는 방향으로 변화시킬 수 있다.

이 책 『생각이 바뀌는 순간』은 밀러와 같은 비극적인 사건뿐만 아니라 우리의 일상 작은 고민 속에서도 긍정적인 직관은 강력한 힘을 발휘한다고 이야기한다. 매번 실패하는 다이어트, 더딘 성과, 꼬인 인간관계, 그 안에서 직관이 어떻게 발동하고, 어떤 식으로 생성되는지에 대해 알면, 반대로 이러한 직관을 활용하여 내가 원하는 방향으로 상황과 인생을 바꿀 수 있을 것이다.'
where p_no = 3;

select * from product;
select * from `user`;


insert into user values('dbstmfql','윤슬비','tjrmagml750'),
						('rnjsalswl','권민지','rnjsalswl97');
				
select * from product join type using (t_no) where p_no = 2;

select * from cart;
insert into cart values(null,1,1,'dbstmfql');

